// 9. Вывести на экран четные числа от 1 до N
int i=2;
int N=10;
N=Convert.ToInt32(Console.ReadLine());
//нц пока i<=N
//кц
while (i<=N)
{
    System.Console.WriteLine(i);   
    i=i+2;
}

